# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Parameters
nc: 1 # number of classes
scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# Backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]      # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]     # 1-P2/4
  - [-1, 3, C2f, [128, True]]      # 2
  - [-1, 1, Conv, [256, 3, 2]]     # 3-P3/8
  - [-1, 6, C2f, [256, True]]      # 4
  - [-1, 1, Conv, [512, 3, 2]]     # 5-P4/16
  - [-1, 6, C2f, [512, True]]      # 6
  - [-1, 1, Conv, [1024, 3, 2]]    # 7-P5/32
  - [-1, 3, C2f, [1024, True]]     # 8
  - [-1, 1, SPPF, [1024, 5]]       # 9

# Head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 10
  - [[-1, 6], 1, Concat, [1]]                    # 11 cat backbone P4
  - [-1, 3, C2f, [512]]                          # 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 13
  - [[-1, 4], 1, Concat, [1]]                    # 14 cat backbone P3
  - [-1, 3, C2f, [256]]                          # 15 (P3/8-small)
  - [-1, 1, SCAM, []]                            # 16 新增 SCAM 直接挂空即可，在模块内会根据输入自动计算参数

  - [-1, 1, Conv, [256, 3, 2]]                   # 17
  - [[-1, 12], 1, Concat, [1]]                   # 18 cat head P4
  - [-1, 3, C2f, [512]]                          # 19 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]                   # 20
  - [[-1, 9], 1, Concat, [1]]                    # 21 cat head P5
  - [-1, 3, C2f, [1024]]                         # 22 (P5/32-large)

  - [[16, 19, 22], 1, Detect, [nc]]              # Detect(P3, P4, P5)